app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Test@Test"], ["LIMIT", 1]]
---
  def create
    username = params[:user][:username]
    password = params[:user][:password]

    # using the method we defined above
    user = User.find_from_credentials(username, password)